//
//  TehillimDataModel.swift
//  Daven4Me
//
//  Created by user on 6/23/19.
//  Copyright © 2019 user. All rights reserved.
//

import Foundation

class TehillimDataModel: Codable {
    
    var tehillimDict = [String: String]()
    //var tehillimChapters = [TehillimChapter]()
    var chapters =  [String]()
    
    init() {
       setUpTehillimDict()
       // setUpBookOfTehillim()
    }
    
    
     func setUpBookOfTehillim() {
        
        var arrayOfChapStrings = createArrayOfChapterString()
        createArrayOfChapterObjects(chapterStrings: arrayOfChapStrings)
        
    }
    
    func createArrayOfChapterString() -> [String] {
       //load text file as one long string
         let tehillimTextURL = Bundle.main.url(forResource: "RawTehillimText", withExtension: ".txt")
         
         let textString = try! String(contentsOf: tehillimTextURL!)
         
       
         let splitByChapters = textString.components(separatedBy: "Chapter")
          
        print("the state of string is \(splitByChapters[0...3])")
          
          return splitByChapters
    }
    
func createArrayOfChapterObjects(chapterStrings:[String]) -> [String] {
        
    var tehillimChapStrings =    [String]()
        
        for chapterString in chapterStrings {
            //print("the state of chapter is \(chapterString)")
            let chapter = chapterString
            tehillimChapStrings.append(chapter)
            
            
            chapters = tehillimChapStrings
        }
        return   tehillimChapStrings
        
    }
    
    
        
    func setUpTehillimDict() {
        let chapters = createArrayOfTehillimChapters()
                     
                     
         tehillimDict = createDictionaryNamesToChapters(chapters: chapters)
       
        
       
        let jsonEncoder = JSONEncoder()
        let jsonData = try! jsonEncoder.encode(tehillimDict)
        

        _ = String(data: jsonData, encoding: .utf8)!
      
    }
    
 
    func createArrayOfTehillimChapters() -> [String] {
    
        //load text file as one long string
       let tehillimTextURL = Bundle.main.url(forResource: "Chapter119Plain", withExtension: ".txt")
       
       let textString = try! String(contentsOf: tehillimTextURL!)
       
      
       let splitByChapters = textString.components(separatedBy: ".")
        
        return splitByChapters
    }
    // passing in an ordered list of paragraphs set up a dictionary
        func createDictionaryNamesToChapters(chapters: [String]) -> [String: String] {
      
          var namesToParagraphs = [String: String]()
         
          //loop through and create dictionry with keys
          for (index, hebLetrr) in  HebrewData.LetterHebrew.allCases.enumerated() {
        
           // convert to its string
              let rawVlue = hebLetrr.rawValue
              
              // convert to paragraph num
              let paragraphNumber = hebLetrr.convertToParagrahNumber(paragraphLetter: rawVlue)
              let dictKey = hebLetrr.createDictKey(paragraphNum: paragraphNumber)
            
            // create unique dict key for letter
           let dictionaryKey = dictKey
        
           // add the key to the dictionary and set
            // its value to the current
           namesToParagraphs[dictionaryKey] = chapters[index]
        }
        
        return namesToParagraphs
    }
    
func                                                                convArryKeysToArryKapits(kapitlKeys: [String]) -> [String] {
                            
        var  kapitelArray = [String]()
        
        for i in kapitlKeys {
            let paragraph = tehillimDict[i]!
            kapitelArray.append(paragraph)
        }
        
        return kapitelArray
    }
}
 


let tehillim119Dictionary = [
    
    
    "Chapter-119-Paragraph-1": "\n‫אַשְׁרֵי תְמִימֵי־דָרֶךְ הַהֹלְכִים בְּתוֹרַת יְהוָה׃‬\n‫אַשְׁרֵי נֹצְרֵי עֵדֹתָיו בְּכָל־לֵב יִדְרְשׁוּהוּ׃‬\n‫אַף לֹא־פָעֲלוּ עַוְלָה בִּדְרָכָיו הָלָכוּ׃‬\n‫אַתָּה צִוִּיתָה פִקֻּדֶיךָ לִשְׁמֹר מְאֹד׃‬\n‫אַחֲלַי יִכֹּנוּ דְרָכָי לִשְׁמֹר חֻקֶּיךָ׃‬\n‫אָז לֹא־אֵבוֹשׁ בְּהַבִּיטִי אֶל־כָּל־מִצְוֺתֶיךָ׃‬\n‫אוֹדְךָ בְּיֹשֶׁר לֵבָב בְּלָמְדִי מִשְׁפְּטֵי צִדְקֶךָ׃‬\n‫אֶת־חֻקֶּיךָ אֶשְׁמֹר אַל־תַּעַזְבֵנִי עַד־מְאֹד׃‬\n",
    
     "Chapter-119-Paragraph-2": "\n‫בַּמֶּה יְזַכֶּה־נַּעַר אֶת־אָרְחוֹ לִשְׁמֹר כִּדְבָרֶךָ׃‬\n‫בְּכָל־לִבִּי דְרַשְׁתִּיךָ אַל־תַּשְׁגֵּנִי מִמִּצְוֺתֶיךָ׃‬\n‫בְּלִבִּי צָפַנְתִּי אִמְרָתֶךָ לְמַעַן לֹא אֶחֱטָא־לָךְ׃‬\n‫בָּרוּךְ אַתָּה יְהוָה לַמְּדֵנִי חֻקֶּיךָ׃‬\n‫בִּשְׂפָתַי סִפַּרְתִּי כֹּל מִשְׁפְּטֵי־פִיךָ׃‬\n‫בְּדֶרֶךְ עֵדְוֺתֶיךָ שַׂשְׂתִּי כְּעַל כָּל־הוֹן׃‬\n‫בְּפִקֻּדֶיךָ אָשִׂיחָה וְאַבִּיטָה אֹרְחֹתֶיךָ׃‬\n‫בְּחֻקֹּתֶיךָ אֶשְׁתַּעֲשָׁע לֹא אֶשְׁכַּח דְּבָרֶךָ׃‬\n",
     
        "Chapter-119-Paragraph-3": "\n‫גְּמֹל עַל־עַבְדְּךָ אֶחְיֶה וְאֶשְׁמְרָה דְבָרֶךָ׃‬\n‫גַּל־עֵינַי וְאַבִּיטָה נִפְלָאוֹת מִתּוֹרָתֶךָ׃‬\n‫גֵּר אָנֹכִי בָאָרֶץ אַל־תַּסְתֵּר מִמֶּנִּי מִצְוֺתֶיךָ׃‬\n‫גָּרְסָה נַפְשִׁי לְתַאֲבָה אֶל־מִשְׁפָּטֶיךָ בְכָל־עֵת׃‬\n‫גָּעַרְתָּ זֵדִים אֲרוּרִים הַשֹּׁגִים מִמִּצְוֺתֶיךָ׃‬\n‫גַּל מֵעָלַי חֶרְפָּה וָבוּז כִּי עֵדֹתֶיךָ נָצָרְתִּי׃‬\n‫גַּם יָשְׁבוּ שָׂרִים בִּי נִדְבָּרוּ עַבְדְּךָ יָשִׂיחַ בְּחֻקֶּיךָ׃‬\n‫גַּם־עֵדֹתֶיךָ שַׁעֲשֻׁעָי אַנְשֵׁי עֲצָתִי׃‬\n",
        
        "Chapter-119-Paragraph-4": "\n‫דָּבְקָה לֶעָפָר נַפְשִׁי חַיֵּנִי כִּדְבָרֶךָ׃‬\n‫דְּרָכַי סִפַּרְתִּי וַתַּעֲנֵנִי לַמְּדֵנִי חֻקֶּיךָ׃‬\n‫דֶּרֶךְ־פִּקּוּדֶיךָ הֲבִינֵנִי וְאָשִׂיחָה בְּנִפְלְאוֹתֶיךָ׃‬\n‫דָּלְפָה נַפְשִׁי מִתּוּגָה קַיְּמֵנִי כִּדְבָרֶךָ׃‬\n‫דֶּרֶךְ־שֶׁקֶר הָסֵר מִמֶּנִּי וְתוֹרָתְךָ חָנֵּנִי׃‬\n‫דֶּרֶךְ־אֱמוּנָה בָחָרְתִּי מִשְׁפָּטֶיךָ שִׁוִּיתִי׃‬\n‫דָּבַקְתִּי בְעֵדְוֺתֶיךָ יְהוָה אַל־תְּבִישֵׁנִי׃‬\n‫דֶּרֶךְ־מִצְוֺתֶיךָ אָרוּץ כִּי תַרְחִיב לִבִּי׃‬\n",
        
        "Chapter-119-Paragraph-5": "\n‫הוֹרֵנִי יְהוָה דֶּרֶךְ חֻקֶּיךָ וְאֶצְּרֶנָּה עֵקֶב׃‬\n‫הֲבִינֵנִי וְאֶצְּרָה תוֹרָתֶךָ וְאֶשְׁמְרֶנָּה בְכָל־לֵב׃‬\n‫הַדְרִיכֵנִי בִּנְתִיב מִצְוֺתֶיךָ כִּי־בוֹ חָפָצְתִּי׃‬\n‫הַט־לִבִּי אֶל־עֵדְוֺתֶיךָ וְאַל אֶל־בָּצַע׃‬\n‫הַעֲבֵר עֵינַי מֵרְאוֹת שָׁוְא בִּדְרָכֶךָ חַיֵּנִי׃‬\n‫הָקֵם לְעַבְדְּךָ אִמְרָתֶךָ אֲשֶׁר לְיִרְאָתֶךָ׃‬\n‫הַעֲבֵר חֶרְפָּתִי אֲשֶׁר יָגֹרְתִּי כִּי מִשְׁפָּטֶיךָ טוֹבִים׃‬\n‫הִנֵּה תָּאַבְתִּי לְפִקֻּדֶיךָ בְּצִדְקָתְךָ חַיֵּנִי׃‬\n",
 
        
        
         "Chapter-119-Paragraph-6": "\n‫וִיבֹאֻנִי חֲסָדֶךָ יְהוָה תְּשׁוּעָתְךָ כְּאִמְרָתֶךָ׃‬\n‫וְאֶעֱנֶה חֹרְפִי דָבָר כִּי־בָטַחְתִּי בִּדְבָרֶךָ׃‬\n‫וְאַל־תַּצֵּל מִפִּי דְבַר־אֱמֶת עַד־מְאֹד כִּי לְמִשְׁפָּטֶךָ יִחָלְתִּי׃‬\n‫וְאֶשְׁמְרָה תוֹרָתְךָ תָמִיד לְעוֹלָם וָעֶד׃‬\n‫וְאֶתְהַלְּכָה בָרְחָבָה כִּי פִקֻּדֶיךָ דָרָשְׁתִּי׃‬\n‫וַאֲדַבְּרָה בְעֵדֹתֶיךָ נֶגֶד מְלָכִים וְלֹא אֵבוֹשׁ׃‬\n‫וְאֶשְׁתַּעֲשַׁע בְּמִצְוֺתֶיךָ אֲשֶׁר אָהָבְתִּי׃‬\n‫וְאֶשָּׂא־כַפַּי אֶל־מִצְוֺתֶיךָ אֲשֶׁר אָהָבְתִּי וְאָשִׂיחָה בְחֻקֶּיךָ׃‬\n",
         
         
          "Chapter-119-Paragraph-7": "\n‫זְכֹר־דָּבָר לְעַבְדֶּךָ עַל אֲשֶׁר יִחַלְתָּנִי׃‬\n‫זֹאת נֶחָמָתִי בְעָנְיִי כִּי אִמְרָתְךָ חִיָּתְנִי׃‬\n‫זֵדִים הֱלִיצֻנִי עַד־מְאֹד מִתּוֹרָתְךָ לֹא נָטִיתִי׃‬\n‫זָכַרְתִּי מִשְׁפָּטֶיךָ מֵעוֹלָם יְהוָה וָאֶתְנֶחָם׃‬\n‫זַלְעָפָה אֲחָזַתְנִי מֵרְשָׁעִים עֹזְבֵי תּוֹרָתֶךָ׃‬\n‫זְמִרוֹת הָיוּ־לִי חֻקֶּיךָ בְּבֵית מְגוּרָי׃‬\n‫זָכַרְתִּי בַלַּיְלָה שִׁמְךָ יְהוָה וָאֶשְׁמְרָה תּוֹרָתֶךָ׃‬\n‫זֹאת הָיְתָה־לִּי כִּי פִקֻּדֶיךָ נָצָרְתִּי׃‬\n",
         
          "Chapter-119-Paragraph-8": "\n‫חֶלְקִי יְהוָה אָמַרְתִּי לִשְׁמֹר דְּבָרֶיךָ׃‬\n‫חִלִּיתִי פָנֶיךָ בְכָל־לֵב חָנֵּנִי כְּאִמְרָתֶךָ׃‬\n‫חִשַּׁבְתִּי דְרָכָי וָאָשִׁיבָה רַגְלַי אֶל־עֵדֹתֶיךָ׃‬\n‫חַשְׁתִּי וְלֹא הִתְמַהְמָהְתִּי לִשְׁמֹר מִצְוֺתֶיךָ׃‬\n‫חֶבְלֵי רְשָׁעִים עִוְּדֻנִי תּוֹרָתְךָ לֹא שָׁכָחְתִּי׃‬\n‫חֲצוֹת־לַיְלָה אָקוּם לְהוֹדוֹת לָךְ עַל מִשְׁפְּטֵי צִדְקֶךָ׃‬\n‫חָבֵר אָנִי לְכָל־אֲשֶׁר יְרֵאוּךָ וּלְשֹׁמְרֵי פִּקּוּדֶיךָ׃‬\n‫חַסְדְּךָ יְהוָה מָלְאָה הָאָרֶץ חֻקֶּיךָ לַמְּדֵנִי׃‬\n",
         
     
             "Chapter-119-Paragraph-9": "\n‫טוֹב עָשִׂיתָ עִם־עַבְדְּךָ יְהוָה כִּדְבָרֶךָ׃‬\n‫טוּב טַעַם וָדַעַת לַמְּדֵנִי כִּי בְמִצְוֺתֶיךָ הֶאֱמָנְתִּי׃‬\n‫טֶרֶם אֶעֱנֶה אֲנִי שֹׁגֵג וְעַתָּה אִמְרָתְךָ שָׁמָרְתִּי׃‬\n‫טוֹב־אַתָּה וּמֵטִיב לַמְּדֵנִי חֻקֶּיךָ׃‬\n‫טָפְלוּ עָלַי שֶׁקֶר זֵדִים אֲנִי בְּכָל־לֵב אֱצֹּר פִּקּוּדֶיךָ׃‬\n‫טָפַשׁ כַּחֵלֶב לִבָּם אֲנִי תּוֹרָתְךָ שִׁעֲשָׁעְתִּי׃‬\n‫טוֹב־לִי כִי־עֻנֵּיתִי לְמַעַן אֶלְמַד חֻקֶּיךָ׃‬\n‫טוֹב־לִי תוֹרַת־פִּיךָ מֵאַלְפֵי זָהָב וָכָסֶף׃‬\n",
         
        
    "Chapter-119-Paragraph-10": "\n‫יָדֶיךָ עָשׂוּנִי וַיְכוֹנְנוּנִי הֲבִינֵנִי וְאֶלְמְדָה מִצְוֺתֶיךָ׃‬\n‫יְרֵאֶיךָ יִרְאוּנִי וְיִשְׂמָחוּ כִּי לִדְבָרְךָ יִחָלְתִּי׃‬\n‫יָדַעְתִּי יְהוָה כִּי־צֶדֶק מִשְׁפָּטֶיךָ וֶאֱמוּנָה עִנִּיתָנִי׃‬\n‫יְהִי־נָא חַסְדְּךָ לְנַחֲמֵנִי כְּאִמְרָתְךָ לְעַבְדֶּךָ׃‬\n‫יְבֹאוּנִי רַחֲמֶיךָ וְאֶחְיֶה כִּי־תוֹרָתְךָ שַׁעֲשֻׁעָי׃‬\n‫יֵבֹשׁוּ זֵדִים כִּי־שֶׁקֶר עִוְּתוּנִי אֲנִי אָשִׂיחַ בְּפִקּוּדֶיךָ׃‬\n‫יָשׁוּבוּ לִי יְרֵאֶיךָ וידעו [וְיֹדְעֵי] עֵדֹתֶיךָ׃‬\n‫יְהִי־לִבִּי תָמִים בְּחֻקֶּיךָ לְמַעַן לֹא אֵבוֹשׁ׃‬\n",
        
             
             
             
    "Chapter-119-Paragraph-12": "\n‫כָּלוּ עֵינַי לְאִמְרָתֶךָ לֵאמֹר מָתַי תְּנַחֲמֵנִי׃‬\n‫כִּי־הָיִיתִי כְּנֹאד בְּקִיטוֹר חֻקֶּיךָ לֹא שָׁכָחְתִּי׃‬\n‫כַּמָּה יְמֵי־עַבְדֶּךָ מָתַי תַּעֲשֶׂה בְרֹדְפַי מִשְׁפָּט׃‬\n‫כָּרוּ־לִי זֵדִים שִׁיחוֹת אֲשֶׁר לֹא כְתוֹרָתֶךָ׃‬\n‫כָּל־מִצְוֺתֶיךָ אֱמוּנָה שֶׁקֶר רְדָפוּנִי עָזְרֵנִי׃‬\n‫כִּמְעַט כִּלּוּנִי בָאָרֶץ וַאֲנִי לֹא־עָזַבְתִּי פִקֻּודֶיךָ׃‬\n‫כְּחַסְדְּךָ חַיֵּנִי וְאֶשְׁמְרָה עֵדוּת פִּיךָ׃‬\n",
    
     
    "Chapter-119-Paragraph-13": "\n‫לְעוֹלָם יְהוָה דְּבָרְךָ נִצָּב בַּשָּׁמָיִם׃‬\n‫לְדֹר וָדֹר אֱמוּנָתֶךָ כּוֹנַנְתָּ אֶרֶץ וַתַּעֲמֹד׃‬\n‫לְמִשְׁפָּטֶיךָ עָמְדוּ הַיּוֹם כִּי הַכֹּל עֲבָדֶיךָ׃‬\n‫לוּלֵי תוֹרָתְךָ שַׁעֲשֻׁעָי אָז אָבַדְתִּי בְעָנְיִי׃‬\n‫לְעוֹלָם לֹא־אֶשְׁכַּח פִּקּוּדֶיךָ כִּי בָם חִיִּיתָנִי׃‬\n‫לְךָ־אֲנִי הוֹשִׁיעֵנִי כִּי פִקּוּדֶיךָ דָרָשְׁתִּי׃‬\n‫לִי קִוּוּ רְשָׁעִים לְאַבְּדֵנִי עֵדֹתֶיךָ אֶתְבּוֹנָן׃‬\n‫לְכָל תִּכְלָה רָאִיתִי קֵץ רְחָבָה מִצְוָתְךָ מְאֹד׃‬\n",
    
    
    
    "Chapter-119-Paragraph-14": "\n‫מָה־אָהַבְתִּי תוֹרָתֶךָ כָּל־הַיּוֹם הִיא שִׂיחָתִי׃‬\n‫מֵאֹיְבַי תְּחַכְּמֵנִי מִצְוֺתֶךָ כִּי לְעוֹלָם הִיא־לִי׃‬\n‫מִכָּל־מְלַמְּדַי הִשְׂכַּלְתִּי כִּי עֵדְוֺתֶיךָ שִׂיחָה לִי׃‬\n‫מִזְּקֵנִים אֶתְבּוֹנָן כִּי פִקּוּדֶיךָ נָצָרְתִּי׃‬\n‫מִכָּל־אֹרַח רָע כָּלִאתִי רַגְלָי לְמַעַן אֶשְׁמֹר דְּבָרֶךָ׃‬\n‫מִמִּשְׁפָּטֶיךָ לֹא־סָרְתִּי כִּי־אַתָּה הוֹרֵתָנִי׃‬\n‫מַה־נִּמְלְצוּ לְחִכִּי אִמְרָתֶךָ מִדְּבַשׁ לְפִי׃‬\n‫מִפִּקּוּדֶיךָ אֶתְבּוֹנָן עַל־כֵּן שָׂנֵאתִי כָּל־אֹרַח שָׁקֶר׃‬\n",
   
    
    
    "Chapter-119-Paragraph-15": "\n‫מֵאֹיְבַי תְּחַכְּמֵנִי מִצְוֺתֶךָ כִּי לְעוֹלָם הִיא־לִי׃‬\n‫מִכָּל־מְלַמְּדַי הִשְׂכַּלְתִּי כִּי עֵדְוֺתֶיךָ שִׂיחָה לִי׃‬\n‫מִזְּקֵנִים אֶתְבּוֹנָן כִּי פִקּוּדֶיךָ נָצָרְתִּי׃‬\n‫מִכָּל־אֹרַח רָע כָּלִאתִי רַגְלָי לְמַעַן אֶשְׁמֹר דְּבָרֶךָ׃‬\n‫מִמִּשְׁפָּטֶיךָ לֹא־סָרְתִּי כִּי־אַתָּה הוֹרֵתָנִי׃‬\n‫מַה־נִּמְלְצוּ לְחִכִּי אִמְרָתֶךָ מִדְּבַשׁ לְפִי׃‬\n‫מִפִּקּוּדֶיךָ אֶתְבּוֹנָן עַל־כֵּן שָׂנֵאתִי כָּל־אֹרַח שָׁקֶר׃‬\n",
    
     "Chapter-119-Paragraph-16": "\n‫נֵר־לְרַגְלִי דְבָרֶךָ וְאוֹר לִנְתִיבָתִי׃‬\n‫נִשְׁבַּעְתִּי וָאֲקַיֵּמָה לִשְׁמֹר מִשְׁפְּטֵי צִדְקֶךָ׃‬\n‫נַעֲנֵיתִי עַד־מְאֹד יְהוָה חַיֵּנִי כִדְבָרֶךָ׃‬\n‫נִדְבוֹת פִּי רְצֵה־נָא יְהוָה וּמִשְׁפָּטֶיךָ לַמְּדֵנִי׃‬\n‫נַפְשִׁי בְכַפִּי תָמִיד וְתוֹרָתְךָ לֹא שָׁכָחְתִּי׃‬\n‫נָתְנוּ רְשָׁעִים פַּח לִי וּמִפִּקּוּדֶיךָ לֹא תָעִיתִי׃‬\n‫נָחַלְתִּי עֵדְוֺתֶיךָ לְעוֹלָם כִּי־שְׂשׂוֹן לִבִּי הֵמָּה׃‬\n‫נָטִיתִי לִבִּי לַעֲשׂוֹת חֻקֶּיךָ לְעוֹלָם עֵקֶב׃‬\n",
    
        
    "Chapter-119-Paragraph-17": "\n‫נִשְׁבַּעְתִּי וָאֲקַיֵּמָה לִשְׁמֹר מִשְׁפְּטֵי צִדְקֶךָ׃‬\n‫נַעֲנֵיתִי עַד־מְאֹד יְהוָה חַיֵּנִי כִדְבָרֶךָ׃‬\n‫נִדְבוֹת פִּי רְצֵה־נָא יְהוָה וּמִשְׁפָּטֶיךָ לַמְּדֵנִי׃‬\n‫נַפְשִׁי בְכַפִּי תָמִיד וְתוֹרָתְךָ לֹא שָׁכָחְתִּי׃‬\n‫נָתְנוּ רְשָׁעִים פַּח לִי וּמִפִּקּוּדֶיךָ לֹא תָעִיתִי׃‬\n‫נָחַלְתִּי עֵדְוֺתֶיךָ לְעוֹלָם כִּי־שְׂשׂוֹן לִבִּי הֵמָּה׃‬\n‫נָטִיתִי לִבִּי לַעֲשׂוֹת חֻקֶּיךָ לְעוֹלָם עֵקֶב׃‬\n",
    
    
     "Chapter-119-Paragraph-18": "\n‫סֵעֲפִים שָׂנֵאתִי וְתוֹרָתְךָ אָהָבְתִּי׃‬\n‫סִתְרִי וּמָגִנִּי אָתָּה לִדְבָרְךָ יִחָלְתִּי׃‬\n‫סוּרוּ־מִמֶּנִּי מְרֵעִים וְאֶצְּרָה מִצְוֺת אֱלֹהָי׃‬\n‫סָמְכֵנִי כְאִמְרָתְךָ וְאֶחְיֶה וְאַל־תְּבִישֵׁנִי מִשִּׂבְרִי׃‬\n‫סְעָדֵנִי וְאִוָּשֵׁעָה וְאֶשְׁעָה בְחֻקֶּיךָ תָמִיד׃‬\n‫סָלִיתָ כָּל־שׁוֹגִים מֵחֻקֶּיךָ כִּי־שֶׁקֶר תַּרְמִיתָם׃‬\n‫סִגִים הִשְׁבַּתָּ כָל־רִשְׁעֵי־אָרֶץ לָכֵן אָהַבְתִּי עֵדֹתֶיךָ׃‬\n‫סָמַר מִפַּחְדְּךָ בְשָׂרִי וּמִמִּשְׁפָּטֶיךָ יָרֵאתִי׃‬\n",
    
       "Chapter-119-Paragraph-19": "\n‫עָשִׂיתִי מִשְׁפָּט וָצֶדֶק בַּל־תַּנִּיחֵנִי לְעֹשְׁקָי׃‬\n‫עֲרֹב עַבְדְּךָ לְטוֹב אַל־יַעַשְׁקֻנִי זֵדִים׃‬\n‫עֵינַי כָּלוּ לִישׁוּעָתֶךָ וּלְאִמְרַת צִדְקֶךָ׃‬\n‫עֲשֵׂה עִם־עַבְדְּךָ כְחַסְדֶּךָ וְחֻקֶּיךָ לַמְּדֵנִי׃‬\n‫עַבְדְּךָ־אָנִי הֲבִינֵנִי וְאֵדְעָה עֵדֹתֶיךָ׃‬\n‫עֵת לַעֲשׂוֹת לַיהוָה הֵפֵרוּ תּוֹרָתֶךָ׃‬\n‫עַל־כֵּן אָהַבְתִּי מִצְוֺתֶיךָ מִזָּהָב וּמִפָּז׃‬\n‫עַל־כֵּן כָּל־פִּקּוּדֵי כֹל יִשָּׁרְתִּי כָּל־אֹרַח שֶׁקֶר שָׂנֵאתִי׃‬\n",
   
     
    
     "Chapter-119-Paragraph-20": "\n‫פְּלָאוֹת עֵדְוֺתֶיךָ עַל־כֵּן נְצָרָתַם נַפְשִׁי׃‬\n‫פֵּתַח דְּבָרֶיךָ יָאִיר מֵבִין פְּתָיִים׃‬\n‫פִּי־פָעַרְתִּי וָאֶשְׁאָפָה כִּי לְמִצְוֺתֶיךָ יָאָבְתִּי׃‬\n‫פְּנֵה־אֵלַי וְחָנֵּנִי כְּמִשְׁפָּט לְאֹהֲבֵי שְׁמֶךָ׃‬\n‫פְּעָמַי הָכֵן בְּאִמְרָתֶךָ וְאַל־תַּשְׁלֶט־בִּי כָל־אָוֶן׃‬\n‫פְּדֵנִי מֵעֹשֶׁק אָדָם וְאֶשְׁמְרָה פִּקּוּדֶיךָ׃‬\n‫פָּנֶיךָ הָאֵר בְּעַבְדֶּךָ וְלַמְּדֵנִי אֶת־חֻקֶּיךָ׃‬\n‫פַּלְגֵי־מַיִם יָרְדוּ עֵינָי עַל לֹא־שָׁמְרוּ תוֹרָתֶךָ׃‬\n",
     
         "Chapter-119-Paragraph-21": "\n‫פֵּתַח דְּבָרֶיךָ יָאִיר מֵבִין פְּתָיִים׃‬\n‫פִּי־פָעַרְתִּי וָאֶשְׁאָפָה כִּי לְמִצְוֺתֶיךָ יָאָבְתִּי׃‬\n‫פְּנֵה־אֵלַי וְחָנֵּנִי כְּמִשְׁפָּט לְאֹהֲבֵי שְׁמֶךָ׃‬\n‫פְּעָמַי הָכֵן בְּאִמְרָתֶךָ וְאַל־תַּשְׁלֶט־בִּי כָל־אָוֶן׃‬\n‫פְּדֵנִי מֵעֹשֶׁק אָדָם וְאֶשְׁמְרָה פִּקּוּדֶיךָ׃‬\n‫פָּנֶיךָ הָאֵר בְּעַבְדֶּךָ וְלַמְּדֵנִי אֶת־חֻקֶּיךָ׃‬\n‫פַּלְגֵי־מַיִם יָרְדוּ עֵינָי עַל לֹא־שָׁמְרוּ תוֹרָתֶךָ׃‬\n",
         
         
    "Chapter-119-Paragraph-22": "\n‫צַדִּיק אַתָּה יְהוָה וְיָשָׁר מִשְׁפָּטֶיךָ׃‬\n‫צִוִּיתָ צֶדֶק עֵדֹתֶיךָ וֶאֱמוּנָה מְאֹד׃‬\n‫צִמְּתַתְנִי קִנְאָתִי כִּי־שָׁכְחוּ דְבָרֶיךָ צָרָי׃‬\n‫צְרוּפָה אִמְרָתְךָ מְאֹד וְעַבְדְּךָ אֲהֵבָהּ׃‬\n‫צָעִיר אָנֹכִי וְנִבְזֶה פִּקֻּדֶיךָ לֹא שָׁכָחְתִּי׃‬\n‫צִדְקָתְךָ צֶדֶק לְעוֹלָם וְתוֹרָתְךָ אֱמֶת׃‬\n‫צַר־וּמָצוֹק מְצָאוּנִי מִצְוֺתֶיךָ שַׁעֲשֻׁעָי׃‬\n‫צֶדֶק עֵדְוֺתֶיךָ לְעוֹלָם הֲבִינֵנִי וְאֶחְיֶה׃‬\n",
    
    
    "Chapter-119-Paragraph-23": "\n‫צִוִּיתָ צֶדֶק עֵדֹתֶיךָ וֶאֱמוּנָה מְאֹד׃‬\n‫צִמְּתַתְנִי קִנְאָתִי כִּי־שָׁכְחוּ דְבָרֶיךָ צָרָי׃‬\n‫צְרוּפָה אִמְרָתְךָ מְאֹד וְעַבְדְּךָ אֲהֵבָהּ׃‬\n‫צָעִיר אָנֹכִי וְנִבְזֶה פִּקֻּדֶיךָ לֹא שָׁכָחְתִּי׃‬\n‫צִדְקָתְךָ צֶדֶק לְעוֹלָם וְתוֹרָתְךָ אֱמֶת׃‬\n‫צַר־וּמָצוֹק מְצָאוּנִי מִצְוֺתֶיךָ שַׁעֲשֻׁעָי׃‬\n‫צֶדֶק עֵדְוֺתֶיךָ לְעוֹלָם הֲבִינֵנִי וְאֶחְיֶה׃‬\n",

    
    "Chapter-119-Paragraph-24": "\n‫קָרָאתִי בְכָל־לֵב עֲנֵנִי יְהוָה חֻקֶּיךָ אֶצֹּרָה׃‬\n‫קְרָאתִיךָ הוֹשִׁיעֵנִי וְאֶשְׁמְרָה עֵדֹתֶיךָ׃‬\n‫קִדַּמְתִּי בַנֶּשֶׁף וָאֲשַׁוֵּעָה לדבריך [לִדְבָרְךָ] יִחָלְתִּי׃‬\n‫קִדְּמוּ עֵינַי אַשְׁמֻרוֹת לָשִׂיחַ בְּאִמְרָתֶךָ׃‬\n‫קוֹלִי שִׁמְעָה כְחַסְדֶּךָ יְהוָה כְּמִשְׁפָּטֶךָ חַיֵּנִי׃‬\n‫קָרְבוּ רֹדְפֵי זִמָּה מִתּוֹרָתְךָ רָחָקוּ׃‬\n‫קָרוֹב אַתָּה יְהוָה וְכָל־מִצְוֺתֶיךָ אֱמֶת׃‬\n‫קֶדֶם יָדַעְתִּי מֵעֵדֹתֶיךָ כִּי לְעוֹלָם יְסַדְתָּם׃‬\n",

      
    "Chapter-119-Paragraph-25": "\n‫רְאֵה־עָנְיִי וְחַלְּצֵנִי כִּי־תוֹרָתְךָ לֹא שָׁכָחְתִּי׃‬\n‫רִיבָה רִיבִי וּגְאָלֵנִי לְאִמְרָתְךָ חַיֵּנִי׃‬\n‫רָחוֹק מֵרְשָׁעִים יְשׁוּעָה כִּי־חֻקֶּיךָ לֹא דָרָשׁוּ׃‬\n‫רַחֲמֶיךָ רַבִּים יְהוָה כְּמִשְׁפָּטֶיךָ חַיֵּנִי׃‬\n‫רַבִּים רֹדְפַי וְצָרָי מֵעֵדְוֺתֶיךָ לֹא נָטִיתִי׃‬\n‫רָאִיתִי בֹגְדִים וָאֶתְקוֹטָטָה אֲשֶׁר אִמְרָתְךָ לֹא שָׁמָרוּ׃‬\n‫רְאֵה כִּי־פִקּוּדֶיךָ אָהָבְתִּי יְהוָה כְּחַסְדְּךָ חַיֵּנִי׃‬\n‫רֹאשׁ־דְּבָרְךָ אֱמֶת וּלְעוֹלָם כָּל־מִשְׁפַּט צִדְקֶךָ׃‬\n",
    
     "Chapter-119-Paragraph-26": "\n‫שָׂרִים רְדָפוּנִי חִנָּם ומדבריך [וּמִדְּבָרְךָ] פָּחַד לִבִּי׃‬\n‫שָׂשׂ אָנֹכִי עַל־אִמְרָתֶךָ כְּמוֹצֵא שָׁלָל רָב׃‬\n‫שֶׁקֶר שָׂנֵאתִי וַאֲתַעֵבָה תּוֹרָתְךָ אָהָבְתִּי׃‬\n‫שֶׁבַע בַּיּוֹם הִלַּלְתִּיךָ עַל מִשְׁפְּטֵי צִדְקֶךָ׃‬\n‫שָׁלוֹם רָב לְאֹהֲבֵי תוֹרָתֶךָ וְאֵין־לָמוֹ מִכְשׁוֹל׃‬\n‫שִׂבַּרְתִּי לִישׁוּעָתְךָ יְהוָה וּמִצְוֺתֶיךָ עָשִׂיתִי׃‬\n‫שָׁמְרָה נַפְשִׁי עֵדֹתֶיךָ וָאֹהֲבֵם מְאֹד׃‬\n‫שָׁמַרְתִּי פִקּוּדֶיךָ וְעֵדֹתֶיךָ כִּי כָל־דְּרָכַי נֶגְדֶּךָ׃‬\n",
    
    
   
    "Chapter-119-Paragraph-27": "\n‫תִּקְרַב רִנָּתִי לְפָנֶיךָ יְהוָה כִּדְבָרְךָ הֲבִינֵנִי׃‬\n‫תָּבוֹא תְּחִנָּתִי לְפָנֶיךָ כְּאִמְרָתְךָ הַצִּילֵנִי׃‬\n‫תַּבַּעְנָה שְׂפָתַי תְּהִלָּה כִּי תְלַמְּדֵנִי חֻקֶּיךָ׃‬\n‫תַּעַן לְשׁוֹנִי אִמְרָתֶךָ כִּי כָל־מִצְוֺתֶיךָ צֶּדֶק׃‬\n‫תְּהִי־יָדְךָ לְעָזְרֵנִי כִּי פִקּוּדֶיךָ בָחָרְתִּי׃‬\n‫תָּאַבְתִּי לִישׁוּעָתְךָ יְהוָה וְתוֹרָתְךָ שַׁעֲשֻׁעָי׃‬\n‫תְּחִי־נַפְשִׁי וּתְהַלְלֶךָּ וּמִשְׁפָּטֶךָ יַעֲזְרֻנִי׃‬\n‫תָּעִיתִי כְּשֶׂה אֹבֵד בַּקֵּשׁ עַבְדֶּךָ כִּי מִצְוֺתֶיךָ לֹא שָׁכָחְתִּי׃‬\n",

    "Chapter-119-Paragraph-space": "\nSpace‬\n",
    ]

 
